---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.HVACLoadType
source: html/866699eb-b26f-651c-d849-47c9c815c2d3.htm
---
# HVACLoadType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.